export default function BestThreads() {
  return (
    <div className="flex flex-col p-4 rounded-[10px] gap-2 bg-gradient-to-b from-[#312C85] to-[#2A2471] h-full">
      {/* 標題區域 */}
      <div className="flex items-center gap-1 mb-[8px]">
        <svg
          xmlns="http://www.w3.org/2000/svg"
          width="24"
          height="24"
          viewBox="0 0 24 24"
          fill="none"
        >
          <path
            fill-rule="evenodd"
            clip-rule="evenodd"
            d="M5 2C5 1.44772 5.44772 1 6 1H18C18.5523 1 19 1.44772 19 2V3H19.5C20.4283 3 21.3185 3.36875 21.9749 4.02513C22.6313 4.6815 23 5.57174 23 6.5C23 7.42826 22.6313 8.3185 21.9749 8.97487C21.3185 9.63125 20.4283 10 19.5 10H18.9282C18.7137 11.4868 18.0245 12.875 16.9497 13.9497C16.3778 14.5217 15.7171 14.9844 15 15.3246V16.9938C15.0036 17.0035 15.0154 17.027 15.0489 17.0652C15.1168 17.1425 15.2352 17.2313 15.3879 17.3015L14.97 18.21L15.3861 17.3007C16.7473 17.9236 17.6555 19.3617 17.92 21H20C20.5523 21 21 21.4477 21 22C21 22.5523 20.5523 23 20 23H4C3.44772 23 3 22.5523 3 22C3 21.4477 3.44772 21 4 21H6.07995C6.3444 19.3622 7.25214 17.9245 8.61268 17.3012C8.76508 17.231 8.88325 17.1424 8.95106 17.0652C8.98459 17.027 8.99636 17.0035 9 16.9938V15.3246C8.2829 14.9844 7.62219 14.5217 7.05025 13.9497C5.97552 12.875 5.28635 11.4868 5.07177 10H4.5C3.57174 10 2.6815 9.63125 2.02513 8.97487C1.36875 8.3185 1 7.42826 1 6.5C1 5.57174 1.36875 4.6815 2.02513 4.02513C2.6815 3.36875 3.57174 3 4.5 3H5V2ZM5 5H4.5C4.10218 5 3.72064 5.15804 3.43934 5.43934C3.15804 5.72064 3 6.10218 3 6.5C3 6.89782 3.15804 7.27936 3.43934 7.56066C3.72064 7.84196 4.10218 8 4.5 8H5V5ZM7 3H17V9C17 10.3261 16.4732 11.5979 15.5355 12.5355C14.5979 13.4732 13.3261 14 12 14C10.6739 14 9.40215 13.4732 8.46447 12.5355C7.52678 11.5979 7 10.3261 7 9V3ZM19 5V8H19.5C19.8978 8 20.2794 7.84196 20.5607 7.56066C20.842 7.27936 21 6.89782 21 6.5C21 6.10218 20.842 5.72064 20.5607 5.43934C20.2794 5.15804 19.8978 5 19.5 5H19ZM11 15.9282V17C11 18.1503 10.0612 18.8364 9.44791 19.1185L9.44612 19.1193C8.89479 19.3716 8.34812 20.0419 8.11602 21H15.884C15.6519 20.0419 15.1052 19.3716 14.5539 19.1193L14.5521 19.1185C13.9388 18.8364 13 18.1503 13 17V15.9282C12.6707 15.9758 12.3366 16 12 16C11.6634 16 11.3293 15.9758 11 15.9282Z"
            fill="white"
          />
        </svg>
        <span className="text-[#E5E7EB]">最佳串文</span>
      </div>

      {/* 內容區域 */}
      <div className="flex flex-col gap-[8px]">
        {/* 互動數據 */}
        <div className="flex flex-col">
          <span className="text-[32px] leading-[32px] text-white font-bold">
            434
          </span>
          <span className="text-[#99A1AE] mt-[0px]">互動數</span>
        </div>

        {/* 文章內容 */}
        <div className="flex flex-col">
          <div className="flex flex-col gap-[4px]">
            <p className="text-white text-[14px] leading-[21px] line-clamp-2">
              Threads 儀表板開發日記Day7 - 敏感資訊放在.env管理並使用.gitignore
              今天整理了一下程式碼發現之前用的一些access token
            </p>
            <div className="flex gap-2 text-[#99A1AE] text-[14px]">
              <span>2025-3-1</span>
              <span>8:32 p.m.</span>
            </div>
          </div>
        </div>
      </div>

      {/* 按鈕 */}
      <button className="mt-auto flex items-center justify-center gap-1 h-[40px] bg-white rounded-full border border-[#E5E7EB] w-[104px]">
        <span className="text-[#030712] text-[14px]">分析串文</span>
      </button>
    </div>
  );
}
